/*
 ┌─────────────────────────────────────────────────────────────────────────┐
 │ Практическое занятие №1.                                                │
 ├─────────────────────────────────────────────────────────────────────────┤
 │ Знакомство со средой программирования.                                  │
 │ Разработка линейного алгоритма.                                         │
 ├─────────────────────────────────────────────────────────────────────────┤
 │ Пример 1. Вычисление суммы двух чисел.                                  │
 ├─────────────────────────────────────────────────────────────────────────┤
 │ Напишите программу, которая запрашивает у пользователя два целых числа, │
 │ а затем выводит их сумму.                                               │
 └─────────────────────────────────────────────────────────────────────────┘
 
 ┌────────────────────────────────────┐
 │ Выполнение программы.              │
 ├─────────────────┬──────────────────┤
 │ Входные данные: │ Выходные данные: │
 ├─────────────────┼──────────────────┤
 │ первое число:   │ сумма:           │
 │ a = 2           │ sum = 5          │
 │ второе число:   │                  │
 │ b = 3           │                  │
 └─────────────────┴──────────────────┘
 */

namespace Lab_01_01
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Title = "Практическое занятие №1. Пример 1.";

            Console.Write("Введите первое число: ");
            var a = int.Parse(Console.ReadLine());

            Console.Write("Введите второе число: ");
            var b = int.Parse(Console.ReadLine());

            var sum = a + b;

            Console.WriteLine($"{a} + {b} = {sum}");

            Console.ReadLine();
        }
    }
}
