/*
 ┌───────────────────────────────────────────────────────────────────────────────┐
 │ Практическое занятие №3.                                                      │
 ├───────────────────────────────────────────────────────────────────────────────┤
 │ Разработка разветвляющегося алгоритма, используя оператор выбора.             │
 ├───────────────────────────────────────────────────────────────────────────────┤
 │ Пример 1. Определение количества дней в месяце.                               │
 ├───────────────────────────────────────────────────────────────────────────────┤
 │ Напишите программу, которая запрашивает у пользователя номер месяца,          │
 │ а затем выводит количество дней в этом месяце (високосные года не учитывать). │
 └───────────────────────────────────────────────────────────────────────────────┘
 
 ┌─────────────────────────────────────┐
 │ Выполнение программы.               │
 ├──────────────────┬──────────────────┤
 │ Входные данные:  │ Выходные данные: │
 ├──────────────────┼──────────────────┤
 │ номер месяца:    │ количество дней: │
 │ month = 9        │ dayCount = 30    │
 └──────────────────┴──────────────────┘
 */

namespace Lab_03_01
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Title = "Практическое занятие №3. Пример 1.";

            Console.Write("Введите номер месяца: ");
            var month = int.Parse(Console.ReadLine());

            var dayCount = 0;

            switch (month)
            {
                case 1 or 3 or 5 or 7 or 8 or 10 or 12:
                    dayCount = 31;
                    break;

                case 4 or 6 or 9 or 11:
                    dayCount = 30;
                    break;

                case 2:
                    dayCount = 28;
                    break;
            }

            if (dayCount != 0)
            {
                Console.WriteLine($"В указанном месяце {dayCount} дней.");
            }
            else
            {
                Console.WriteLine("Месяц указан неверно.");
            }

            Console.ReadLine();
        }
    }
}
