/*
 ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
 │ Практическое занятие №8.                                                                                     │
 ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Обработка двумерных массивов.                                                                                │
 ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Пример 2. .                                             │
 ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Напишите программу, которая запрашивает у пользователя размерность массива,                                  │ 
 │ генерирует массив целых чисел в диапазоне [0, 10), а затем вычисляет . │
 └──────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
 
 ┌────────────────────────────────────────────────┐
 │ Выполнение программы.                          │
 ├──────────────────────┬─────────────────────────┤
 │ Входные данные:      │ Выходные данные:        │
 ├──────────────────────┼─────────────────────────┤
 │ размерность массива: │ среднее арифметическое: │
 │ rowCount = 3         │ avg = 4,67              │
 │ columnCount = 3      │                         │
 │ массив:              │                         │
 │ matrix = {           │                         │
 │          {3, 2, 9},  │                         │
 │          {3, 2, 9},  │                         │
 │          {3, 2, 9},  │                         │
 │          }           │                         │
 └──────────────────────┴─────────────────────────┘
 */

namespace Lab_08_02
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Title = "Практическое занятие №8. Пример 2.";

            Console.Write("Введите количество строк: ");
            var rowCount = int.Parse(Console.ReadLine());

            Console.Write("Введите количество столбцов: ");
            var columnCount = int.Parse(Console.ReadLine());

            var matrix = new int[rowCount, columnCount];

            var rnd = new Random();

            Console.WriteLine("Полученный массив:");

            var line = new string('─', matrix.GetLength(1) * 6 - 1);

            Console.WriteLine($"┌{line}┐");
            for (var i = 0; i < matrix.GetLength(0); i++)
            {
                for (var j = 0; j < matrix.GetLength(1); j++)
                {
                    matrix[i, j] = rnd.Next(10);
                    Console.Write($"│  {matrix[i, j]}  ");
                }

                Console.WriteLine("│");

                if (i != matrix.GetLength(0) - 1)
                {
                    Console.WriteLine($"│{line}│");
                }
                else
                {
                    Console.WriteLine($"└{line}┘");
                }
            }

            Console.ReadLine();
        }
    }
}
