/*
 ┌──────────────────────────────────────────────────────────────────────────┐
 │ Практическое занятие №5.                                                 │
 ├──────────────────────────────────────────────────────────────────────────┤
 │ Разработка циклического алгоритма, используя цикл с предусловием.        │
 ├──────────────────────────────────────────────────────────────────────────┤
 │ Пример 2. Определение частоты повторений четных и нечетных цифр числа.   │
 ├──────────────────────────────────────────────────────────────────────────┤
 │ Напишите программу, которая запрашивает у пользователя натуральное число │
 │ и определяет, какие цифры в нем: четные или нечетные встречаются чаще.   │
 └──────────────────────────────────────────────────────────────────────────┘
 
 ┌───────────────────────────────────────────┐
 │ Выполнение программы.                     │
 ├────────────────────┬──────────────────────┤
 │ Входные данные:    │ Выходные данные:     │
 ├────────────────────┼──────────────────────┤
 │ натуральное число: │ результат:           │
 │ number = 56789     │ нечетных цифр больше │
 └────────────────────┴──────────────────────┘
 */

namespace Lab_05_02
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Title = "Практическое занятие №5. Пример 2.";

            Console.Write("Введите натуральное число: ");
            var number = int.Parse(Console.ReadLine());

            var numberCopy = number;

            var evenDigitCount = 0;
            var oddDigitCount  = 0;

            while (numberCopy != 0)
            {
                var digit = numberCopy % 10;

                if (digit % 2 == 0)
                {
                    evenDigitCount++;
                }
                else
                {
                    oddDigitCount++;
                }
                
                numberCopy /= 10;
            }

            if (evenDigitCount != oddDigitCount)
            {
                Console.WriteLine($"В числе {number} больше " +
                                  $"{((evenDigitCount > oddDigitCount) ? "четных" : "нечетных")} цифр.");
            }
            else
            {
                Console.WriteLine($"В числе {number} одинаковое количество четных и нечетных цифр.");
            }

            Console.ReadLine();
        }
    }
}
