/*
 ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
 │ Практическое занятие №7.                                                                                     │
 ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Обработка одномерных массивов.                                                                               │
 ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Пример 2. Вычисление среднего арифмитического элементов массива.                                             │
 ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Напишите программу, которая запрашивает у пользователя размерность массива,                                  │ 
 │ генерирует массив целых чисел в диапазоне [0, 10), а затем вычисляет среднего арифмитического его элементов. │
 └──────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
 
 ┌────────────────────────────────────────────────┐
 │ Выполнение программы.                          │
 ├──────────────────────┬─────────────────────────┤
 │ Входные данные:      │ Выходные данные:        │
 ├──────────────────────┼─────────────────────────┤
 │ размерность массива: │ среднее арифметическое: │
 │ itemCount = 3        │ avg = 4,67              │
 │ массив:              │                         │
 │ array = {3, 2, 9}    │                         │
 └──────────────────────┴─────────────────────────┘
 */

namespace Lab_07_02
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Title = "Практическое занятие №7. Пример 2.";

            Console.Write("Введите размерность массива: ");
            var itemCount = int.Parse(Console.ReadLine());

            var array = new int[itemCount];

            var rnd = new Random();

            Console.WriteLine("Полученный массив:");

            var line = new string('─', array.Length * 6 - 1);

            Console.WriteLine($"┌{line}┐");
            for (var i = 0; i < array.Length; i++)
            {
                array[i] = rnd.Next(10);
                Console.Write($"│  {array[i]}  ");
            }
            Console.WriteLine("│");
            Console.WriteLine($"└{line}┘");

            var sum = 0.0;

            for (var i = 0; i < array.Length; i++)
            {
                sum += array[i];
            }

            var avg = sum / array.Length;

            Console.WriteLine($"Среднее арифметическое элементов массива: {Math.Round(avg, 2)}.");
            
            Console.ReadLine();
        }
    }
}
