/*
 ┌────────────────────────────────────────────────────────────────────────────────┐
 │ Практическое занятие №1.                                                       │
 ├────────────────────────────────────────────────────────────────────────────────┤
 │ Знакомство со средой программирования.                                         │
 │ Разработка линейного алгоритма.                                                │
 ├────────────────────────────────────────────────────────────────────────────────┤
 │ Пример 3. Вычисление площади квадрата.                                         │
 ├────────────────────────────────────────────────────────────────────────────────┤
 │ Напишите программу, которая запрашивает у пользователя длину стороны квадрата, │
 │ а затем выводит его площадь.                                                   │
 └────────────────────────────────────────────────────────────────────────────────┘
 
 ┌──────────────────────────────────────┐
 │ Выполнение программы.                │
 ├───────────────────┬──────────────────┤
 │ Входные данные:   │ Выходные данные: │
 ├───────────────────┼──────────────────┤
 │ сторона квадрата: │ площадь:         │
 │ side = 5,2        │ area = 27,04     │
 └───────────────────┴──────────────────┘
 */

namespace Lab_01_03
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Title = "Практическое занятие №1. Пример 3.";

            Console.Write("Введите длину стороны квадрата: ");
            var side = double.Parse(Console.ReadLine());

            var area = Math.Pow(side, 2);

            Console.WriteLine($"Площадь квадрата со стороной {side} равна {Math.Round(area, 2)}.");

            Console.ReadLine();
        }
    }
}
