/*
 ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────┐
 │ Практическое занятие №6.                                                                                 │
 ├──────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Разработка циклического алгоритма, используя цикл с постусловием.                                        │
 ├──────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Пример 2. Определение номера первого отрицательного элемента последовательности чисел.                   │
 ├──────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Напишите программу, которая запрашивает у пользователя последовательность целых чисел, оканчивающуюся 5, │ 
 │ и определяет номер первого отрицательного элемента.                                                      │
 └──────────────────────────────────────────────────────────────────────────────────────────────────────────┘
 
 ┌─────────────────────────────────────────────────────────────────┐
 │ Выполнение программы.                                           │
 ├───────────────────────────┬─────────────────────────────────────┤
 │ Входные данные:           │ Выходные данные:                    │
 ├───────────────────────────┼─────────────────────────────────────┤
 │ последовательность чисел: │ номер первого отрицательного числа: │
 │ 1 8 3 -9 3 -1 5           │ position = 4                        │
 └───────────────────────────┴─────────────────────────────────────┘
 */

namespace Lab_06_02
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Title = "Практическое занятие №6. Пример 2.";

            var number = 0;

            var count    = 0;
            var position = 0;

            do
            {
                Console.Write("Введите число последовательности: ");
                number = int.Parse(Console.ReadLine());
                
                count++;

                if (number < 0 && position == 0)
                {
                    position = count;
                }
            } while (number != 5);

            Console.WriteLine($"Номер первого отрицательного элемента последовательности: {position}");

            Console.ReadLine();
        }
    }
}
