/*
 ┌───────────────────────────────────────────────────────────────────────────────────────────────────────┐
 │ Практическое занятие №9.                                                                              │
 ├───────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Сортировка массивов.                                                                                  │
 ├───────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Пример 3. Сортировка вставками.                                                                       │
 ├───────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Напишите программу, которая запрашивает у пользователя размерность массива,                           │ 
 │ генерирует массив целых чисел в диапазоне [-2, 6), а затем сортирует его методом вставок по убыванию. │
 └───────────────────────────────────────────────────────────────────────────────────────────────────────┘
 
 ┌─────────────────────────────────────────────────────────────┐
 │ Выполнение программы.                                       │
 ├──────────────────────────────┬──────────────────────────────┤
 │ Входные данные:              │ Выходные данные:             │
 ├──────────────────────────────┼──────────────────────────────┤
 │ размерность массива:         │ отсортированный массив:      │
 │ itemCount = 6                │ array = {5, 4, 2, 1, -1, -2} │ 
 │ исходный массив:             │                              │
 │ array = {-1, 4, 2, 1, 5, -2} │                              │
 └──────────────────────────────┴──────────────────────────────┘
 */

namespace Lab_09_03
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Title = "Практическое занятие №9. Пример 3.";

            Console.Write("Введите размерность массива: ");
            var itemCount = int.Parse(Console.ReadLine());

            var array = new int[itemCount];

            var rnd = new Random();

            Console.WriteLine("Исходный массив:");

            var line = new string('─', array.Length * 7 - 1);

            Console.WriteLine($"┌{line}┐");
            for (var i = 0; i < array.Length; i++)
            {
                array[i] = rnd.Next(-2, 6);
                Console.Write($"│  {array[i], 2}  ");
            }
            Console.WriteLine("│");
            Console.WriteLine($"└{line}┘");

            for (var i = 1; i < array.Length; i++)
            {
                var key = array[i];
                var j   = i - 1;

                while (j >= 0 && array[j] < key)
                {
                    array[j + 1] = array[j];
                    array[j]     = key;

                    j--;
                }
            }

            Console.WriteLine("Отсортированный массив:");

            Console.WriteLine($"┌{line}┐");
            foreach (var item in array)
            {
                Console.Write($"│  {item, 2}  ");
            }
            Console.WriteLine("│");
            Console.WriteLine($"└{line}┘");

            Console.ReadLine();
        }
    }
}
