/*
 ┌────────────────────────────────────────────────────────────────────────────────────────┐
 │ Практическое занятие №7.                                                               │
 ├────────────────────────────────────────────────────────────────────────────────────────┤
 │ Обработка одномерных массивов.                                                         │
 ├────────────────────────────────────────────────────────────────────────────────────────┤
 │ Пример 1. Поиск минимального элемента в массиве.                                       │
 ├────────────────────────────────────────────────────────────────────────────────────────┤
 │ Напишите программу, которая запрашивает у пользователя размерность массива,            │ 
 │ генерирует массив целых чисел в диапазоне [-10, 10] и находит его минимальный элемент. │
 └────────────────────────────────────────────────────────────────────────────────────────┘
 
 ┌──────────────────────────────────────────────────┐
 │ Выполнение программы.                            │
 ├───────────────────────────┬──────────────────────┤
 │ Входные данные:           │ Выходные данные:     │
 ├───────────────────────────┼──────────────────────┤
 │ размерность массива:      │ минимальный элемент: │
 │ itemCount = 5             │ minItem = -5         │
 │ массив:                   │                      │
 │ array = {-2, 8, 3, -5, 1} │                      │
 └───────────────────────────┴──────────────────────┘
 */

namespace Lab_07_01
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Title = "Практическое занятие №7. Пример 1.";

            Console.Write("Введите размерность массива: ");
            var itemCount = int.Parse(Console.ReadLine());

            var array = new int[itemCount];

            var rnd = new Random();

            Console.WriteLine("Полученный массив:");

            var line = new string('─', array.Length * 8 - 1);

            Console.WriteLine($"┌{line}┐");
            for (var i = 0; i < array.Length; i++)
            {
                array[i] = rnd.Next(-10, 10 + 1);
                Console.Write($"│  {array[i], 3}  ");
            }
            Console.WriteLine("│");
            Console.WriteLine($"└{line}┘");

            var minItem = array[0];

            for (var i = 0; i < array.Length; i++)
            {
                if (array[i] < minItem)
                {
                    minItem = array[i];
                }
            }

            Console.WriteLine($"Минимальный элемент массива: {minItem}");

            Console.ReadLine();
        }
    }
}
