/*
 ┌────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
 │ Практическое занятие №9.                                                                                   │
 ├────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Сортировка массивов.                                                                                       │
 ├────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Пример 1. Сортировка простым обменом.                                                                      │
 ├────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
 │ Напишите программу, которая запрашивает у пользователя параметры массива,                                  │ 
 │ генерирует массив вещественных чисел, а затем сортирует его методом пузырьковой сортировки по возрастанию. │
 └────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
 
 ┌───────────────────────────────────────────────────────────────────────┐
 │ Выполнение программы.                                                 │
 ├───────────────────────────────────┬───────────────────────────────────┤
 │ Входные данные:                   │ Выходные данные:                  │
 ├───────────────────────────────────┼───────────────────────────────────┤
 │ размерность массива:              │ отсортированный массив:           │
 │ itemCount = 4                     │ array = {3.86, 6.49, 9.11, 22.91} │ 
 │ минимальное значение:             │                                   │
 │ minValue = 1                      │                                   │
 │ максимальное значение:            │                                   │
 │ maxValue = 99                     │                                   │
 │ исходный массив:                  │                                   │
 │ array = {3.86, 22.91, 9.11, 6.49} │                                   │
 └───────────────────────────────────┴───────────────────────────────────┘
 */

namespace Lab_09_01
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Title = "Практическое занятие №9. Пример 1.";

            Console.Write("Введите размерность массива: ");
            var itemCount = int.Parse(Console.ReadLine());

            Console.Write("Введите минимальное значение массива: ");
            var minValue = double.Parse(Console.ReadLine());

            Console.Write("Введите максимальное значение массива: ");
            var maxValue = double.Parse(Console.ReadLine());

            var array = new double[itemCount];

            var rnd = new Random();

            Console.WriteLine("Исходный массив:");

            var line = new string('─', array.Length * 10 - 1);

            Console.WriteLine($"┌{line}┐");
            for (var i = 0; i < array.Length; i++)
            {
                array[i] = Math.Round(rnd.NextDouble() * (maxValue - minValue) + minValue, 2);
                Console.Write($"│  {array[i],5}  ");
            }
            Console.WriteLine("│");
            Console.WriteLine($"└{line}┘");

            for (var i = 0; i < array.Length - 1; i++)
            {
                for (var j = i + 1; j < array.Length; j++)
                {
                    if (array[i] > array[j])
                    {
                        var tmp = array[i];
                        array[i] = array[j];
                        array[j] = tmp;
                    }
                }
            }

            Console.WriteLine("Отсортированный массив:");

            Console.WriteLine($"┌{line}┐");
            foreach (var item in array)
            {
                Console.Write($"│  {item, 5}  ");
            }
            Console.WriteLine("│");
            Console.WriteLine($"└{line}┘");

            Console.ReadLine();
        }
    }
}
