/*
 ┌───────────────────────────────────────────────────────────────────────────┐
 │ Практическое занятие №5.                                                  │
 ├───────────────────────────────────────────────────────────────────────────┤
 │ Разработка циклического алгоритма, используя цикл с предусловием.         │
 ├───────────────────────────────────────────────────────────────────────────┤
 │ Пример 1. Вычисление количества цифр числа.                               │
 ├───────────────────────────────────────────────────────────────────────────┤
 │ Напишите программу, которая запрашивает у пользователя натуральное число, │
 │ а затем выводит количество цифр в нем.                                    │
 └───────────────────────────────────────────────────────────────────────────┘
 
 ┌───────────────────────────────────────┐
 │ Выполнение программы.                 │
 ├────────────────────┬──────────────────┤
 │ Входные данные:    │ Выходные данные: │
 ├────────────────────┼──────────────────┤
 │ натуральное число: │ количество цифр: │
 │ number = 12345     │ digitCount = 5   │
 └────────────────────┴──────────────────┘
 */

namespace Lab_05_01
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Title = "Практическое занятие №5. Пример 1.";

            Console.Write("Введите натуральное число: ");
            var number = int.Parse(Console.ReadLine());

            var numberCopy = number;
            var digitCount = 0;

            while (numberCopy != 0)
            {
                numberCopy /= 10;
                digitCount++;
            }

            Console.WriteLine($"Количество цифр в числе {number}: {digitCount}.");

            Console.ReadLine();
        }
    }
}
